In [2]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                    'data':[4,3,2,1,12,3,4,5,7]})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [3]:
# by=['group','data'],ascending = [False,True] 横坐标以group降序的前提下再data升序
# inplace对原始数据操作
data.sort_values(by=['group','data'],ascending = [False,True],inplace=True)
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [4]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                   'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [5]:
data.sort_values(by='k2') # 以k2值排序

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [6]:
data.drop_duplicates() # 以k1k2同时重复的元素去重复

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [7]:
data.drop_duplicates(subset='k1') # 以k1为索引去重复

    k1  k2
0  one   3
3  two   3

In [8]:
data = pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],'data':[1,2,3,4,5,6,7]})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [9]:

def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
        return 'A'
    elif series['food'] == 'B1':
        return 'B'
    elif series['food'] == 'B2':
        return 'B'
    elif series['food'] == 'B3':
        return 'B'
    elif series['food'] == 'C1':
        return 'C'
    elif series['food'] == 'C2':
        return 'C'
# apply，对data数据的每个样本都执行food_map函数
data['food_map'] = data.apply(food_map,axis = 'columns') 
data

  food  data food_map
0   A1     1        A
1   A2     2        A
2   B1     3        B
3   B2     4        B
4   B3     5        B
5   C1     6        C
6   C2     7        C

In [10]:
food2Upper = {
    'A1':'A',
    'A2':'A',
    'B1':'B',
    'B2':'B',
    'B3':'B',
    'C1':'C',
    'C2':'C'
}
data['upper'] = data['food'].map(food2Upper)
data

  food  data food_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [11]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df2 = df.assign(ration = df['data1']/df['data2']) # 增加数据
# df['ration'] = df['data1']/df['data2']

In [12]:
df2

      data1     data2    ration
0  0.767331 -0.664801 -1.154227
1  0.666514 -0.301074 -2.213790
2  0.483316 -0.473785 -1.020118
3 -2.273256  0.236520 -9.611265
4  0.803198 -0.740407 -1.084806

In [30]:
df2.drop('ration',axis='columns',inplace=True) # 删除

In [31]:
df2

      data1     data2
0 -1.069925 -0.186540
1  0.636127  0.020425
2  0.366197 -0.102836
3 -0.975327  0.451201
4 -1.562407 -2.436845

In [32]:
data = pd.Series([1,2,3,4,5,6,7,8,9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [33]:
data.replace(9,np.nan,inplace=True) # 替换

In [34]:
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [35]:
# 离散化
ages = [15,18,20,21,22,34,41,52,63,79]
bins = [10,40,80] # 10-40，40-80两个区间
bins_res = pd.cut(ages,bins) # ages带切分数据，bin3切分指定，如写5默认均分5份
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64]): [(10, 40] < (40, 80]]

In [36]:
bins_res.labels # 调属性

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: 'labels' is deprecated. Use 'codes' instead
  if __name__ == '__main__':

array([0, 0, 0, 0, 0, 0, 1, 1, 1, 1], dtype=int8)

In [37]:
pd.value_counts(bins_res) # 统计结果

(10, 40]    6
(40, 80]    4
dtype: int64

In [38]:
pd.cut(ages,[10,30,50,80])

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], (30, 50], (30, 50], (50, 80], (50, 80], (50, 80]]
Categories (3, interval[int64]): [(10, 30] < (30, 50] < (50, 80]]

In [39]:
group_names = ['Yonth','Mille','Old']
#pd.cut(ages,[10,20,50,80],labels=group_names)
pd.value_counts(pd.cut(ages,[10,20,50,80],labels=group_names)) # labels给指定bin区间命名

Mille    4
Old      3
Yonth    3
dtype: int64

In [41]:
df = pd.DataFrame([range(3),[0, np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [42]:
df.isnull() # 判断缺失值

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [43]:
df.isnull().any() # 只看有缺失值

0    False
1     True
2     True
dtype: bool

In [44]:
df.isnull().any(axis = 1)

0    False
1     True
2     True
3    False
dtype: bool

In [45]:
df.fillna(5) # 缺失值填充为5

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [46]:
df[df.isnull().any(axis = 1)] # 有缺失值的数据

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN